Revit 2026 API

# IFCTransaction Methods

---

The IFCTransaction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Commit | Commits all changes made to the IFC file during the transaction. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | RollBack | Rolls back all changes made to the IFC file during the transaction. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

IFCTransaction Class

Autodesk.Revit.DB.IFC Namespace